/**
\file lib.c
\brief Файл з реалізацією функцій

Цей файл, містить реалізацію функції CreateConst.
*/

#include <stdio.h>
#include <string.h>

/**
 
 Функція mul_matrix
 \param a[] - масив у якому зберігається строка яку ввів користувач.
 \return Повертає сформоване число або нуль.
 
 
 Послідовність дій
 
- Створення змінних
	number_letter - кількість букв у слові
	res - число яке сформувала функція.

- Перевіряємо порожня наша строка чи ні, як що так то повертємо 0.

- Як що строка не порожня то рахуємо скільки в ній літер та цифр.

- Запускаємо цил який буде пребирати слова у нашому речені.

- Запускаємо другий цикл який буде преебирати літери у нашому слові.

- Первіряємо як що це латиниця або число то додаємо до j + 1. Як що не те не інше перевіряємо на те чи це кирилиця, як що так то додаємо до кількості літер +1 і до j та i +1 так як кирилиця займає два байти. Як що це щось інше завершуємо цикл та переходимо до наступного слова.

- Потім присвоюємо різницю між j та кількітю літер змінній number_letter, таким чином слова у яких є кирилиця дорівнюють кількості символлів а не кількості занятих байт.

- Перевіряємо як що у слові кількість літер більша ніж 10 то множимо змінну res на 100 та додаємо кількість літер, як що менше десяти то множимо змінну res на 10 та додаємо кількість літер.

- Повертаємо res. 

*/

long int CreateConst(char str[])
{	
	int number_letter;
	long int res = 0;
	
	if(*(str) == '\0')
		return 0;
	
	for(int i = 0, j = 0; *(str + i) != '\0';i++)    
	{		
		number_letter = 0;
		
		for(j = 0;*(str + i) != ' '; i++, j++)
		{	
			if( (*(str + i) >= 'a' && 'z' >= *(str + i)) || (*(str + i) >= 'A' && 'Z' >= *(str + i)) || (*(str + i) >= '0' && '9' >= *(str + i)) )
			{
			
			}
			else if(strncmp(&*(str + i),"А", 2) >= 0 && strncmp(&*(str + i),"я", 2)  <= 0){
			
				number_letter++;
				j++;
				i++;
			}
			else if(strncmp(&*(str + i),"ї", 2) == 0 || strncmp(&*(str + i),"Ї", 2) == 0 || 
				strncmp(&*(str + i),"є", 2) == 0 || strncmp(&*(str + i),"Є", 2) == 0 || 
				strncmp(&*(str + i),"і", 2) == 0 || strncmp(&*(str + i),"І", 2) == 0 || 
				strncmp(&*(str + i),"ґ", 2) == 0 || strncmp(&*(str + i),"Ґ", 2) == 0){
			
				number_letter++;
				j++;
				i++;
			}
			else
				break;
												
		}
		
		number_letter = j - number_letter;
		
		if(number_letter != 0)
		{
			
			if(number_letter >= 10)
			{
				res = (res * 100) + number_letter;
			}
			else
				res = (res * 10) + number_letter;
		}
	}
	
	return res;
}











