/**
 * \mainpage
 * # Лабораторна робота №13
 *
 * \author Марков Владислав, КН-922б
 * \date 03-04-2023
 */

/*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу, код для запису строки,
виклики функцій CreateConst та код виводу результату її роботи .
*/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "lib.h"

/**
 Головна функція.

 Послідовність дій

- Створення змінних
	str - маисв куди записуємо строку
	res - число яке сформувала функція.
	
	
- Виводимо на екран інформацію про автора, номер, тему лабараторної роботи , і що виконує програма
- Записуємо строку яку ввів користувач
- Викликаємо функцію CreateConst та записуємо результат який вона повернула у змінну res
- Виводимо результат на екран
*/

int main()
{
	char str[1000];
	long int res = 0;
	
	printf("\nАвтор:Марков Владислав\nГрупа:КН-922Б\nНомер лабараторної роботи:13\nТема:Строки (Null-terminated C Strings)\n\n");
	printf("Створення числа через кількість букв та чисел у строці\n\n");
	
	fgets(str,1000,stdin);
	
	res = CreateConst(str);
	
	printf("Створене число:%ld", res);

	return 0;
}

















